#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/demo-org-aus-plr/HelloWorldWorkspace/runs/run-avqwzFZ96PYKyNe1

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/b28cfaf3-de3b-4eb1-af68-993ed6839651/resourceGroups/myHwrlsRG-100616476]
azurerm_service_plan.appserviceplan: Refreshing state... [id=/subscriptions/b28cfaf3-de3b-4eb1-af68-993ed6839651/resourceGroups/myHwrlsRG-100616476/providers/Microsoft.Web/serverfarms/hlw-webapp1-asp-100616476]
azurerm_linux_web_app.webapp: Refreshing state... [id=/subscriptions/b28cfaf3-de3b-4eb1-af68-993ed6839651/resourceGroups/myHwrlsRG-100616476/providers/Microsoft.Web/sites/hlw-webapp1-100616476]
azurerm_app_service_source_control.sourcecontrol: Refreshing state... [id=/subscriptions/b28cfaf3-de3b-4eb1-af68-993ed6839651/resourceGroups/myHwrlsRG-100616476/providers/Microsoft.Web/sites/hlw-webapp1-100616476]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service_source_control.sourcecontrol must be replaced
-/+ resource "azurerm_app_service_source_control" "sourcecontrol" {
      ~ id                     = "/subscriptions/b28cfaf3-de3b-4eb1-af68-993ed6839651/resourceGroups/myHwrlsRG-100616476/providers/Microsoft.Web/sites/hlw-webapp1-100616476" -> (known after apply)
      ~ repo_url               = "https://github.com/Azure-Samples/nodejs-docs-hello-world" -> "https://github.com/Azure-Samples/nodejs-docs-hello-world.git" # forces replacement
      ~ scm_type               = "ExternalGit" -> (known after apply)
      ~ use_manual_integration = true -> false # forces replacement
      ~ uses_github_action     = false -> (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ARM_SUBSCRIPTION_ID" but
│ a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-avqwzFZ96PYKyNe1/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ARM_CLIENT_SECRET" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-avqwzFZ96PYKyNe1/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 5 other variable(s)
│ defined without being declared.
╵

```

</details>

*Pushed by: @sreejuGit, Action: `pull_request`*